Revit 2024 API
Reference.UVPoint Property
The UV parameters of the reference, if the reference contains a face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public UV UVPoint { get; }
Visual Basic
Public ReadOnly Property UVPoint As UV
	Get
Visual C++
public:
property UV^ UVPoint {
	UV^ get ();
}
Remarks
This value is valid only for references of type REFERENCE_TYPE_SURFACE. It is null for all other types.
See Also
Reference Class
Autodesk.Revit.DB Namespace